Tekla.Structures.DialogInternal.ProfileDialogOwner
For internal use only !
Class to handle native dialog instance

Tekla.Structures.DialogInternal.ProfileDialogOwner.dialogHandle
The dialog handle.

Tekla.Structures.DialogInternal.ProfileDialogOwner.#ctor(Tekla.Structures.DialogInternal.IDialogOwner)
Construct instance to hold the native dialog handle
dialogHandle: Handle to native dialog

Tekla.Structures.DialogInternal.ProfileDialogOwner.Dispose
Dispose implementation for inp dialog

Tekla.Structures.DialogInternal.ProfileDialogOwner.OnValueChanged(Tekla.Structures.DialogInternal.ProfileAttributes)
Process value changed event
attributes: profile attributes

Tekla.Structures.DialogInternal.ProfileDialogOwner.OnValueChanged(System.Object)
Event handler for passing generic catalog data back to dialog
data: value data